tutorials/laminar/1DAvalancheMuI/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
// alphaEqn
    div(phi,alphas)  Gauss limitedLinear01 1;
    div(phir,alphas) Gauss limitedLinear01 1;
    div(phi,alphaw) Gauss limitedLinear01 1;
    div(phir,alphaw) Gauss limitedLinear01 1;
// UEqn
    div(phi.sol,U.sol)    Gauss limitedLinearV 1;
    div(phif,Uf)    Gauss limitedLinearV 1;
    div(rhoPhi,Uf) Gauss limitedLinearV 1;
    div((rho*phi.sol),U.sol) Gauss limitedLinearV 1;
    div((rho*phif),Uf) Gauss limitedLinearV 1;
    div((rho*Rcs)) Gauss linear;
    div((rhof*Rcf)) Gauss linear;
    div(phiRs,Us) Gauss limitedLinear 1;
    div(phiRf,Uf) Gauss limitedLinear 1;
// pEqn
    div(alphas,nu)   Gauss linear;
// alphaPlastic
    div(phis,alphasPlastic)   Gauss limitedLinear01 1;
// pa
    div(phis,ps_new_value)   Gauss limitedLinear 1;
// k and EpsilonEqn
// ThetaEqn
    div(phi,Theta)  Gauss limitedLinear 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default  linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    alpha.sol;
    alpha.wat;
    p_rgh;
}

// ************************************************************************* //
